<template>
  <div class="service-agreement">
      <p>
        信源豆豆软件服务协议
    </p>
    <p>
        欢迎你使用信源豆豆软件产品及服务！
    </p>
    <p>
        为使用信源豆豆软件（以下简称“本软件”）及服务，您应当阅读并遵守《信源豆豆软件服务协议》（以下简称“本协议”）。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款，以及开通或使用某项服务的单独协议，并选择接受或不接受。
    </p>
    <p>
        除非您已阅读并接受本协议所有条款，否则您无权下载、安装或使用本软件及相关服务。您的下载、安装、使用、获取信源豆豆账号和登录等行为表示您已经阅读并同意本协议条款。
    </p>
    <p>
        北京北信源软件股份有限公司拥有对本授权协议的最终解释权。
    </p>
    <p>
        一、协议范围
    </p>
    <p>
        1.1协议适用主体范围
    </p>
    <p>
        本协议是您与信源豆豆软件之间关于您下载、安装、使用、复制本软件，以及使用信源豆豆软件相关服务所订立的协议。
    </p>
    <p>
        1.2协议关系及冲突条款
    </p>
    <p>
        本协议的内容，包括但不限于以下与本服务、本协议相关的协议、规则、规范以及北信源可能发布的关于本服务的其他相关协议、规则、规范等内容，前述内容一经正式发布，即为本协议不可分割的组成部分，与其构成统一整体，您同样应当遵守。
    </p>
    <p>
        二、关于本服务
    </p>
    <p>
        2.1服务内容
    </p>
    <p>
        本服务内容是指北信源向用户提供的跨平台通讯应用程序（简称“信源豆豆”），提供消息推送、分享、组织架构、多客户端信息同步、名片发送、置顶功能、投票、隐私模式、开放平台；支持企业邮箱、企业签到、私信消息、延时消息、消息列表、阅后即焚、群内私聊、定时发送和接收、活动安排和提醒功能。
    </p>
    <p>
        2.2服务形式
    </p>
    <p>
        您可以通过电脑、手机等终端以客户端形式下载信源豆豆客户端软件使用本服务。北信源提供iOS、Android、Windows等多个应用版本，当您使用本服务时，您应选择与您的终端、系统等相匹配的本软件版本，否则，您可能无法正常使用本服务。同时，北信源会不断丰富您使用本服务的终端、形式等。
    </p>
    <p>
        三、软件的获取
    </p>
    <p>
        您可以直接从信源豆豆的官方网站上获取本软件，也可以从得到北信源授权的第三方获取。
    </p>
    <p>
        如果您从北信源授权的第三方获取本软件或与本软件名称相同的安装程序，北信源无法保证该软件能够正常使用，并对因此给您带来的损失不予负责。
    </p>
    <p>
        四、软件的安装与卸载
    </p>
    <p>
        下载安装程序后，您需要按照该程序提示的步骤正确安装。
    </p>
    <p>
        如果您不再需要使用本软件或者需要安装新版软件，可以自行卸载。如果您愿意，请告知卸载原因，以便信源豆豆更好地改善服务。
    </p>
    <p>
        五、软件的更新
    </p>
    <p>
        5.1北信源将不断努力开发新的服务和提供软件更新（这些更新可能会采取软件替换、修改、功能强化、版本升级等形式）来增进用户体验、完善服务内容。
    </p>
    <p>
        5.2 本软件可能为您默认开启自动升级、更新等功能，您可以在软件设置中自行选择是否需要开启此功能。
    </p>
    <p>
        5.3北信源有权不经向您特别通知而对软件进行更新，或者对软件的部分功能效果进行改变或限制，以增进用户体验、保证本服务的安全性和功能相互一致。
    </p>
    <p>
        5.4 本软件新版本发布后，旧版本的软件可能无法使用。北信源无法保证旧版本软件及相应的客户服务可继续使用，请您随时核对并下载最新版本。
    </p>
    <p>
        六、用户个人信息保护
    </p>
    <p>
        6.1 保护用户个人信息是北信源的一项基本原则，北信源将会采取合理的措施保护用户的个人信息。除法律法规规定的情形外，未经用户许可北信源不会向第三方公开、透露用户个人信息。北信源对相关信息采用专业加密存储与传输方式，保障用户个人信息的安全。
    </p>
    <p>
        6.2 您在注册账号或使用本服务的过程中，需要提供一些必要的信息，例如：为向您提供账号注册服务或进行用户身份识别，需要您填写手机号码；若国家法律法规或政策有特殊规定的，您需要提供真实的身份信息。若您提供的信息不完整，则无法使用本服务或在使用过程中受到限制。
    </p>
    <p>
        6.3 北信源将运用各种安全技术和程序建立完善的管理制度来保护您的个人信息，以免遭受未经授权的访问、使用或披露。
    </p>
    <p>
        6.4 未经您的同意，北信源不会向北信源以外的任何公司、组织和个人披露您的个人信息，但法律法规另有规定的除外。
    </p>
    <p>
        七、主权利义务条款
    </p>
    <p>
        7.1 账号使用规范
    </p>
    <p>
        7.1.1 您在使用本服务前需要注册一个信源豆豆账号。信源豆豆账号可通过手机号码进行注册，可以与邮箱进行绑定，北信源有权根据用户需求或产品需要对账号注册和绑定的方式进行变更。
    </p>
    <p>
        7.1.2 用户有责任妥善保管注册账号信息及账号密码的安全，用户需要对注册账号以及密码下的行为承担法律责任。用户同意在任何情况下不向他人透露账号及密码信息。当在您怀疑他人在使用您的账号时，您应立即通知管理员或北信源公司。
    </p>
    <p>
        7.1.3 用户在使用手机号码注册信源豆豆账号时，系统将为您自动匹配信源豆豆号，您可以对信源豆豆号进行设置，但仅可设置一次，设置信源豆豆号后将无法修改。
    </p>
    <p>
        7.2 用户注意事项
    </p>
    <p>
        7.2.1 您理解并同意：为了向您提供有效的服务，本软件会利用您终端设备的处理器和带宽等资源。本软件使用过程中可能产生数据流量的费用，用户需自行向运营商了解相关资费信息，并自行承担相关费用。
    </p>
    <p>
        7.2.2 您理解并同意：本软件的某些功能可能会让第三方知晓用户的信息，例如：用户的信源豆豆好友可以查询用户头像、名字、信源豆豆号等可公开的个人资料；使用手机号码注册信源豆豆账号或手机号码与信源豆豆账号关联的用户，信源豆豆账号可以被通讯录存有该号码的好友查询；用户关注信源豆豆公众账号后将成为公众账号关注用户，信源豆豆公众账号可以根据其功能权限获取关注用户头像、名字、信源豆豆号、消息评论内容、图片、视频等信息，并可通过信源豆豆公众平台发送消息与关注用户进行互动。关注用户的消息评论内容、向公众账号上传的图片、视频都可以被具备相应功能权限的信源豆豆公众账号发布在公众账号内，供第三方查阅。
    </p>
    <p>
        7.2.3 您理解并同意北信源将会尽其商业上的合理努力保障您在本软件及服务中的数据存储安全，但是，北信源并不能就此提供完全保证，包括但不限于以下情形：
    </p>
    <p>
        7.2.3.1 北信源不对您在本软件及服务中相关数据的删除或储存失败负责；
    </p>
    <p>
        7.2.3.2 北信源有权根据实际情况自行决定单个用户在本软件及服务中数据的最长储存期限，并在服务器上为其分配数据最大存储空间等。您可根据自己的需要自行备份本软件及服务中的相关数据；
    </p>
    <p>
        7.2.3.3 如果您停止使用本软件及服务或服务被终止或取消，北信源可以从服务器上永久地删除您的数据。服务停止、终止或取消后，北信源没有义务向您返还任何数据。
    </p>
    <p>
        7.2.4 用户在使用本软件及服务时，须自行承担如下来自北信源不可掌控的风险内容，包括但不限于：
    </p>
    <p>
        7.2.4.1 由于不可抗拒因素可能引起的个人信息丢失、泄漏等风险；
    </p>
    <p>
        7.2.4.2 用户必须选择与所安装终端设备相匹配的软件版本，否则，由于软件与终端设备型号不相匹配所导致的任何问题或损害，均由用户自行承担；
    </p>
    <p>
        7.2.4.3 用户在使用本软件访问第三方网站时，因第三方网站及相关内容所可能导致的风险，由用户自行承担；
    </p>
    <p>
        7.2.4.4 用户发布的内容被他人转发、分享，因此等传播可能带来的风险和责任；
    </p>
    <p>
        7.2.4.5 由于无线网络信号不稳定、无线网络带宽小等原因，所引起的北信源信源豆豆登录失败、资料同步不完整、页面打开速度慢等风险。
    </p>
    <p>
        八、用户行为规范
    </p>
    <p>
        8.1 信息内容规范
    </p>
    <p>
        8.1.1 本条所述信息内容是指用户使用本软件及服务过程中所制作、复制、发布、传播的任何内容，包括但不限于信源豆豆账号头像、名字、用户说明等注册信息，或文字、语音、图片等发送、回复和相关链接页面，以及其他使用信源豆豆账号或本软件及服务所产生的内容。
    </p>
    <p>
        8.1.2 您理解并同意，信源豆豆一直致力于为用户提供文明健康、规范有序的网络环境，您不得利用信源豆豆账号或本软件及服务制作、复制、发布、传播如下干扰信源豆豆正常运营，以及侵犯其他用户或第三方合法权益的内容，包括但不限于：
    </p>
    <p>
        8.1.2.1 发布、传送、传播、储存违反国家法律法规禁止的内容：
    </p>
    <p>
        （1）违反宪法确定的基本原则的；
    </p>
    <p>
        （2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
    </p>
    <p>
        （3）损害国家荣誉和利益的；
    </p>
    <p>
        （4）煽动民族仇恨、民族歧视，破坏民族团结的；
    </p>
    <p>
        （5）破坏国家宗教政策，宣扬邪教和封建迷信的；
    </p>
    <p>
        （6）散布谣言，扰乱社会秩序，破坏社会稳定的；
    </p>
    <p>
        （7）散布淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的；
    </p>
    <p>
        （8）侮辱或者诽谤他人，侵害他人合法权益的；
    </p>
    <p>
        （9）煽动非法集会、结社、游行、示威、聚众扰乱社会秩序；
    </p>
    <p>
        （10）以非法民间组织名义活动的；
    </p>
    <p>
        （11）不符合《即时通信工具公众信息服务发展管理暂行规定》及遵守法律法规、社会主义制度、国家利益、公民合法利益、公共秩序、社会道德风尚和信息真实性等“七条底线”要求的；
    </p>
    <p>
        （12）含有法律、行政法规禁止的其他内容的。
    </p>
    <p>
        8.1.2.2 发布、传送、传播、储存侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的内容；
    </p>
    <p>
        8.1.2.3 涉及他人隐私、个人信息或资料的；
    </p>
    <p>
        8.1.2.4 发表、传送、传播骚扰、广告信息及垃圾信息或含有任何性或性暗示的；
    </p>
    <p>
        8.1.2.5 其他违反法律法规、政策及公序良俗、社会公德或干扰信源豆豆正常运营和侵犯其他用户或第三方合法权益内容的信息。
    </p>
    <p>
        8.2 软件使用规范
    </p>
    <p>
        除非法律允许或北信源书面许可，您使用本软件过程中不得从事下列行为：
    </p>
    <p>
        8.2.1 删除本软件及其副本上关于著作权的信息；
    </p>
    <p>
        8.2.2 对本软件进行反向工程、反向汇编、反向编译，或者以其他方式尝试发现本软件的源代码；
    </p>
    <p>
        8.2.3 对北信源拥有知识产权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点等；
    </p>
    <p>
        8.2.4 对本软件或者本软件运行过程中释放到任何终端内存中的数据、软件运行过程中客户端与服务器端的交互数据，以及本软件运行所必需的系统数据，进行复制、修改、增加、删除、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或非北信源经授权的第三方工具/服务接入本软件和相关系统；
    </p>
    <p>
        8.2.5 通过修改或伪造软件运行中的指令、数据，增加、删减、变动软件的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论这些行为是否为商业目的；
    </p>
    <p>
        8.2.6 通过非北信源开发、授权的第三方软件、插件、外挂、系统，登录或使用北信源软件及服务，或制作、发布、传播上述工具；
    </p>
    <p>
        8.2.7 自行或者授权他人、第三方软件对本软件及其组件、模块、数据进行干扰；
    </p>
    <p>
        8.2.8 其他未经北信源明示授权的行为。
    </p>
    <p>
        8.3 服务运营规范
    </p>
    <p>
        除非法律允许或北信源书面许可，您使用本服务过程中不得从事下列行为：
    </p>
    <p>
        8.3.1 提交、发布虚假信息，或冒充、利用他人名义的；
    </p>
    <p>
        8.3.2 诱导其他用户点击链接页面或分享信息的；
    </p>
    <p>
        8.3.3 虚构事实、隐瞒真相以误导、欺骗他人的；
    </p>
    <p>
        8.3.4 侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的；
    </p>
    <p>
        8.3.5 未经北信源书面许可利用信源豆豆账号和任何功能，以及第三方运营平台进行推广或互相推广的；
    </p>
    <p>
        8.3.6 利用信源豆豆账号或本软件及服务从事任何违法犯罪活动的；
    </p>
    <p>
        8.3.7 制作、发布与以上行为相关的方法、工具，或对此类方法、工具进行运营或传播，无论这些行为是否为商业目的；
    </p>
    <p>
        8.3.8 其他违反法律法规规定、侵犯其他用户合法权益、干扰产品正常运营或北信源未明示授权的行为。
    </p>
    <p>
        8.4 对自己行为负责
    </p>
    <p>
        您充分了解并同意，您必须为自己注册账号下的一切行为负责，包括您所发表的任何内容以及由此产生的任何后果。您应对本服务中的内容自行加以判断，并承担因使用内容而引起的所有风险，包括因对内容的正确性、完整性或实用性的依赖而产生的风险。北信源无法且不会对因前述风险而导致的任何损失或损害承担责任。
    </p>
    <p>
        8.5 违约处理
    </p>
    <p>
        8.5.1 如果北信源发现或收到他人举报或投诉用户违反本协议约定的，北信源有权不经通知随时对相关内容进行删除、屏蔽，并视行为情节对违规账号处以包括但不限于警告、限制或禁止使用部分或全部功能、账号封禁直至注销的处罚，并公告处理结果。
    </p>
    <p>
        8.5.2 您理解并同意，北信源有权依合理判断对违反有关法律法规或本协议规定的行为进行处罚，对违法违规的任何用户采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，用户应独自承担由此而产生的一切法律责任。
    </p>
    <p>
        8.5.3 您理解并同意，因您违反本协议或相关服务条款的规定，导致或产生第三方主张的任何索赔、要求或损失，您应当独立承担责任；北信源因此遭受损失的，您也应当一并赔偿。
    </p>
    <p>
        九、知识产权声明
    </p>
    <p>
        9.1 北信源是本软件的知识产权权利人。本软件的一切著作权、商标权、专利权、商业秘密等知识产权，以及与本软件相关的所有信息内容（包括但不限于文字、图片、音频、视频、图表、界面设计、版面框架、有关数据或电子文档等）均受中华人民共和国法律法规和相应的国际条约保护，北信源享有上述知识产权，但相关权利人依照法律规定应享有的权利除外。
    </p>
    <p>
        9.2 未经北信源或相关权利人书面同意，您不得为任何商业或非商业目的自行或许可任何第三方实施、利用、转让上述知识产权。
    </p>
    <p>
        十、终端安全责任
    </p>
    <p>
        10.1 您理解并同意，本软件同大多数互联网软件一样，可能会受多种因素影响，包括但不限于用户原因、网络服务质量、社会环境等；也可能会受各种安全问题的侵扰，包括但不限于他人非法利用用户资料，进行现实中的骚扰；用户下载安装的其他软件或访问的其他网站中可能含有病毒、木马程序或其他恶意程序，威胁您的终端设备信息和数据安全，继而影响本软件的正常使用等。因此，您应加强信息安全及个人信息的保护意识，注意密码保护，以免遭受损失。
    </p>
    <p>
        10.2 您不得制作、发布、使用、传播用于窃取信源豆豆账号及他人个人信息、财产的恶意程序。
    </p>
    <p>
        10.3 维护软件安全与正常使用是北信源和您的共同责任，北信源将按照行业标准合理审慎地采取必要技术措施保护您的终端设备信息和数据安全，但是您承认和同意北信源并不能就此提供完全保证。
    </p>
    <p>
        10.4 在任何情况下，您不应轻信借款、索要密码或其他涉及财产的网络信息。涉及财产操作的，请一定先核实对方身份，并请经常留意北信源有关防范诈骗犯罪的提示。
    </p>
    <p>
        十一、其他
    </p>
    <p>
        11.1 您使用本软件即视为您已阅读并同意受本协议的约束。北信源有权在必要时修改本协议条款。您可以在本软件的最新版本中查阅相关协议条款。本协议条款变更后，如果您继续使用本软件，即视为您已接受修改后的协议。如果您不接受修改后的协议，应当停止使用本软件。
    </p>
    <p>
        11.2 本协议签订地为中华人民共和国北京市海淀区。
    </p>
    <p>
        11.3 本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（不包括冲突法）。
    </p>
    <p>
        11.4 若您和北信源之间发生任何纠纷或争议，首先应友好协商解决；协商不成的，您同意将纠纷或争议提交本协议签订地有管辖权的人民法院管辖。
    </p>
    <p>
        11.5 本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。
    </p>
    <p>
        11.6 本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。
    </p>
    <p>
        <br/>
    </p>
    <p>
        <br/>
    </p>
    <p>
        北京北信源软件股份有限公司
    </p>
    <p>
        <br/>
    </p>
  </div>
</template>
<script>
export default {
  data() {
    return {
      
    };
  },
  methods: {
    
  }
};
</script>
<style lang="scss" scoped>
.service-agreement{
  padding:10px;
  height:100%;
  overflow: hidden;
  overflow-y: auto;
}
</style>
